---
kind: method
id: M:Autodesk.Revit.DB.ColorOptions.GetColorOptions
source: html/03c0f25f-d24a-1635-7554-82bbf6775986.htm
---
# Autodesk.Revit.DB.ColorOptions.GetColorOptions Method

Returns the current Revit instance's ColorOptions.

## Syntax (C#)
```csharp
public static ColorOptions GetColorOptions()
```

## Returns
The ColorOptions for the current Revit instance.